Revit 2026 API

# PartUtilsCreateMergedPart Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PartMaker CreateMergedPart(
	Document document,
	ICollection<ElementId> partIds
)
```
```vb
Public Shared Function CreateMergedPart (
	document As Document,
	partIds As ICollection(Of ElementId)
) As PartMaker
```
```cpp
public:
static PartMaker^ CreateMergedPart(
	Document^ document,
	ICollection<ElementId^>^ partIds
)
```
```fsharp
static member CreateMergedPart :
        document : Document *
        partIds : ICollection<ElementId> -> PartMaker
```

#### Parameters

document Document

partIds ICollectionElementId

#### Return Value

PartMaker

#### Reference

PartUtils Class

Autodesk.Revit.DB Namespace